ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV177/ESP32_WordClockV177.ino
// -----------------------------------------------------------------------------
// RX notify callback
// -----------------------------------------------------------------------------
static void TimeSenderNotifyCB( NimBLERemoteCharacteristic*,  uint8_t* data, size_t len, bool notify)
{
 static char buf[128];
 size_t n = (len < sizeof(buf) - 1) ? len : sizeof(buf) - 1;
 memcpy(buf, data, n);
 buf[n] = 0;
 ReworkInputString(String(buf));
 BLEConnectedSince = millis();
}

// -----------------------------------------------------------------------------
// Client callbacks
// -----------------------------------------------------------------------------
class TimeSenderClientCB : public NimBLEClientCallbacks
{
 void onConnect(NimBLEClient* client) override
   {
    TSConnected = true;
    TSConnecting          = false;
    BLEConnectedSince   = millis();
    Tekstprintln("TimeSender connected");
   }

 void onDisconnect(NimBLEClient* client, int reason) override
   {
    TSConnected = false;
    TSConnecting          = false;
    TShaveFoundAddr       = false;
    TSconnectRequested    = false;
    Tekstprintln("TimeSender disconnected");
    StartTimeSenderScan();
   // NimBLEDevice::getScan()->start(0, false, false);
   }
};

//--------------------------------------------                                                //
// Scan callbacks
// -------------------------------------------
class TimeSenderScanCB : public NimBLEScanCallbacks
{
 void onResult(const NimBLEAdvertisedDevice* dev) override
   {
    if (TSConnecting) return;
    if (!dev->haveName()) return;
    std::string rawName = dev->getName();
    if (rawName.find(TIMESENDER_DEVICE_NAME) == std::string::npos) return;
    if (dev->getRSSI() <= TIMESENDER_MIN_RSSI) return;
    if (!dev->isConnectable()) return;
    if (!dev->isAdvertisingService(NimBLEUUID(SERVICE_UUID))) return;
    TSfoundAddr        = dev->getAddress();
    TShaveFoundAddr    = true;
    TSconnectRequested = true;
    NimBLEDevice::getScan()->stop();
   }
};

//--------------------------------------------                                                //
// Start TimeSender scan (call from setup())
// -------------------------------------------
void StartTimeSenderScan(void)
{
  if (TimeSenderRunning) return;
  TimeSenderRunning = true;
  tsFoundDevice = nullptr;  
 NimBLEScan* scan = NimBLEDevice::getScan();
 scan->setScanCallbacks(new TimeSenderScanCB(), false);
 scan->setInterval(160);
 scan->setWindow(30);
 scan->setActiveScan(true);
 scan->start(0, false, false);
 lastTimeSenderScan = millis();
}
//--------------------------------------------                                                //
// BLE Stop Time Sender
//--------------------------------------------
void StopTimeSender()
{
 NimBLEDevice::getScan()->stop();
 if (TSConnected) pClient->disconnect();
 TSConnected = false;
 TSConnecting          = false;
 pRemoteTX           = nullptr;
 pRemoteRX           = nullptr;
 pClient             = nullptr;
 TShaveFoundAddr       = false;
 TSconnectRequested    = false;
}

// -----------------------------------------------------------------------------
// Connect TimeSender
// -----------------------------------------------------------------------------
static void Connect_TimeSender(void)
{
 if (!TShaveFoundAddr || TSConnected || TSConnecting) return;
 const int MAX_CONNECT_ATTEMPTS = 3;
 const unsigned long POST_DISCONNECT_DELAY_MS = 150;
 for (int attempt = 1; attempt <= MAX_CONNECT_ATTEMPTS; ++attempt)
    {
     NimBLEDevice::getScan()->stop();
     delay(100);
     pClient = NimBLEDevice::createClient();
     pClient->setClientCallbacks(new TimeSenderClientCB(), false);
     TSConnecting      = true;
     TSconnectStartms  = millis();
     if (!pClient->connect(TSfoundAddr))
        {
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      NimBLERemoteService* svc = pClient->getService(SERVICE_UUID);
      if (!svc)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      pRemoteTX = svc->getCharacteristic(CHARACTERISTIC_UUID_TX);
      pRemoteRX = svc->getCharacteristic(CHARACTERISTIC_UUID_RX);
      if (!pRemoteTX || !pRemoteRX)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      if (!pRemoteTX->subscribe(true, TimeSenderNotifyCB, true))
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      BLEConnectedSince = millis();
      TShaveFoundAddr     = false;
      TSconnectRequested  = false;
      TSConnecting        = false;
      return;
    }

 if (pClient)
   {
    NimBLEDevice::deleteClient(pClient);
    pClient = nullptr;
   }
 TShaveFoundAddr    = false;
 TSconnectRequested = false;
 NimBLEDevice::getScan()->start(0, false, false);
}

// -----------------------------------------------------------------------------
// Check TimeSender client (call from CheckDevices())
// -----------------------------------------------------------------------------
void CheckTimeSenderClient(void)
{
 unsigned long now = millis();
 if (TSconnectRequested && TShaveFoundAddr && !TSConnected && !TSConnecting)
    {
        TSconnectRequested = false;
        Connect_TimeSender();
    }
 if (TSConnecting && (now - TSconnectStartms > CONNECT_TIMEOUT_MS))
    {
     if (pClient)
       {
        if (pClient->isConnected()) pClient->disconnect();
        NimBLEDevice::deleteClient(pClient);
        pClient = nullptr;
       }
     TSConnecting        = false;
     TShaveFoundAddr     = false;
     TSconnectRequested  = false;
     NimBLEDevice::getScan()->start(0, false, false);
    }

 NimBLEScan* scan = NimBLEDevice::getScan();
 if (!TSConnected && !scan->isScanning() && millis() - lastTimeSenderScan > 3000)
   {
    scan->start(0, false, false);
    lastTimeSenderScan = millis();
   }
}

// End Time Sender

//--------------------------------------------                                                //
// WIFI WIFIEvents
//Yes — using WiFi.onEvent() is definitely the better and more reliable way to handle Wi-Fi connection state on the ESP32.
// ✅ Why WiFi.onEvent() is better
// 1. It’s fully asynchronous
//--------------------------------------------
void WiFiEvent(WiFiEvent_t event)
{
 // snprintf(sptext, sizeof(sptext),"[WiFi-event] event: %d  : ", event);  Tekstprint(sptext);
 WiFiEventInfo_t info;
 static bool LostPrinted = false;
 switch (event) 
     {
 /*
 ARDUINO_EVENT_WIFI_STA_CONNECTED → Connected to AP (no IP yet)
ARDUINO_EVENT_WIFI_STA_GOT_IP → DHCP success (ready for servers, OTA)
ARDUINO_EVENT_WIFI_STA_DISCONNECTED → Lost connection
ARDUINO_EVENT_WIFI_STA_STOP → WiFi off
 */     
        case ARDUINO_EVENT_WIFI_READY: 
            Tekstprintln("WiFi interface ready");
            break;
        case ARDUINO_EVENT_WIFI_SCAN_DONE:
            Tekstprintln("Completed scan for access points");
            break;
        case ARDUINO_EVENT_WIFI_STA_START:
            Tekstprintln("WiFi client started");
            break;
        case ARDUINO_EVENT_WIFI_STA_STOP:
            Tekstprintln("WiFi clients stopped");
            break;
        case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            Tekstprintln("Connected to access point");
            LostPrinted = false;
            break;
       case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            if(!LostPrinted)
             {
              snprintf(sptext, sizeof(sptext),"WiFi lost connection.");                                          // Reason: %d",info.wifi_sta_disconnected.reason); 
              Tekstprintln(sptext);
              LostPrinted = true;
             }
            //WiFi.reconnect(); //is checked in EveryMinuteUpdate()
            break;
        case ARDUINO_EVENT_WIFI_STA_AUTHMODE_CHANGE:
            Tekstprintln("Authentication mode of access point has changed");
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
        /*
✔ Wi-Fi connected
✔ IP address assigned
✔ Network parameters available (IP, subnet, gateway, DNS)
✔ Triggered exactly when it happens
        */
            snprintf(sptext, sizeof(sptext),"Connected to : %s",WiFi.SSID().c_str());
            Tekstprintln(sptext);
            snprintf(sptext, sizeof(sptext), "Obtained IP address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );
            Tekstprintln(sptext);         
            strcpy(Mem.SSID,      WiFi.SSID().c_str());
            strcpy(Mem.Password , WiFi.psk().c_str());                                         // Store SSID and password
            Mem.NTPOn        = 1;                                                              // NTP On
            Mem.WIFIOn       = 1;                                                              // WIFI On  
            delay(100);
            WIFIwasConnected = true;                                                            // Now we know the SSID ans password are correct and we can reconnect
            Mem.WIFIcredentials = SET_AND_OK;
            StoreStructInFlashMemory(); 
            break;
        case ARDUINO_EVENT_WIFI_STA_LOST_IP:
            Tekstprintln("Lost IP address and IP address is reset to 0");
            break;
        case ARDUINO_EVENT_WPS_ER_SUCCESS:
            wpsStop();
            delay(100);
            WiFi.begin();
            delay(200);
            snprintf(sptext, sizeof(sptext), "WPS Successfull, stopping WPS and connecting to: %s: ", WiFi.SSID().c_str());
            Tekstprintln(sptext);       
            break;
        case ARDUINO_EVENT_WPS_ER_FAILED:
            Tekstprintln("WPS Failed, retrying");
            wpsStop();
            wpsStart();
            break;
        case ARDUINO_EVENT_WPS_ER_TIMEOUT:
            Tekstprintln("WPS Timedout, Start WPS again");
            wpsStop();
            // wpsStart();
            break;
        case ARDUINO_EVENT_WPS_ER_PIN:
            snprintf(sptext, sizeof(sptext),"WPS_PIN = %s",wpspin2string(info.wps_er_pin.pin_code).c_str());
            Tekstprintln(sptext);
            break;
        case ARDUINO_EVENT_WIFI_AP_START:
            Tekstprintln("WiFi access point started");
            break;
        case ARDUINO_EVENT_WIFI_AP_STOP:
            Tekstprintln("WiFi access point  stopped");
            break;
        case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
            Tekstprintln("Client connected");
            break;
        case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
            snprintf(sptext, sizeof(sptext),"Client disconnected.");                                            // Reason: %d",info.wifi_ap_stadisconnected.reason); 
            Tekstprintln(sptext);
            break;
        case ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED:
            Tekstprintln("Assigned IP address to client");
            break;
        case ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED:
            Tekstprintln("Received probe request");
            break;
        case ARDUINO_EVENT_WIFI_AP_GOT_IP6:
            Tekstprintln("AP IPv6 is preferred");
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
            Tekstprintln("STA IPv6 is preferred");
            break;
        case ARDUINO_EVENT_ETH_GOT_IP6:
            Tekstprintln("Ethernet IPv6 is preferred");
            break;
        case ARDUINO_EVENT_ETH_START:
            Tekstprintln("Ethernet started");
            break;
        case ARDUINO_EVENT_ETH_STOP:
            Tekstprintln("Ethernet stopped");
            break;
        case ARDUINO_EVENT_ETH_CONNECTED:
            Tekstprintln("Ethernet connected");
            break;
        case ARDUINO_EVENT_ETH_DISCONNECTED:
            // WiFi.scanNetworks will return the number of networks found("Ethernet disconnected");
            break;
        case ARDUINO_EVENT_ETH_GOT_IP:
            Tekstprintln("Obtained IP address");
            break;
        default: break;
    }
    sptext[0] = 0;                                                                            // Clear sptext buffer
}
//--------------------------------------------                                                //
// WIFI Check for WIFI Network 
// Check if WIFI network to connect to is available
// Return true if available
//--------------------------------------------
 bool CheckforWIFINetwork(void)         { return CheckforWIFINetwork(true);}
 bool CheckforWIFINetwork(bool PrintIt)
 {
  if(PrintIt)  Tekstprintln("Scanning for networks");
  int n = WiFi.scanNetworks();                                                                // WiFi.scanNetworks will return the number of networks found
  if (n == 0)                { if(PrintIt) Tekstprintln("No networks found"); return false;} 
  if (n == WIFI_SCAN_FAILED) { if(PrintIt) Tekstprintln("All scan attempts failed - No WIFI connection");  return false;   }
  else 
    { 
     snprintf(sptext, sizeof(sptext),"%d: networks found",n); 
     if(PrintIt) Tekstprintln(sptext);
     for (int i = 0; i < n; ++i)                                                              // Print SSID and RSSI for each network found
      {
        snprintf(sptext, sizeof(sptext),"%2d: %25s %3d %1s",i+1,WiFi.SSID(i).c_str(),(int)WiFi.RSSI(i),(WiFi.encryptionType(i) == WIFI_AUTH_OPEN)?" ":"*");
        if (strcmp(WiFi.SSID(i).c_str(), Mem.SSID)==0) { strcat(sptext, " -- Will connect to");  }
        if(PrintIt) Tekstprintln(sptext);
      }
    }
 return true;                                                                                 // If no SSID and web page at 192.168.4.1 will be started to enter the credentials
 }

//--------------------------------------------                                                //
// WIFI Scan for WIFI stations and print a list of networks found
//--------------------------------------------
void ScanWIFI(void)
{
 WiFi.disconnect(); 
 WiFi.mode(WIFI_STA);                                                                         // Set WiFi to station mode and disconnect from an AP if it was previously connected.
 delay(100);
 int n = WiFi.scanNetworks();                                                                 // WiFi.scanNetworks will return the number of networks found.
 if (n == 0)  { Tekstprintln("no networks found");  } 
 else 
   {
    snprintf(sptext, sizeof(sptext),"%d networks found",n);   Tekstprintln(sptext);
    Tekstprintln("Nr | SSID                             | RSSI | CH | Encryption");
    for(int i = 0; i < n; ++i) 
      {
       snprintf(sptext, sizeof(sptext),"%2d | %-32.32s | %4d | %2d | ",i + 1, 
                       WiFi.SSID(i).c_str(), (int)WiFi.RSSI(i), (int)WiFi.channel(i));        // Print SSID and RSSI for each network found
       Tekstprint(sptext);
       switch (WiFi.encryptionType(i))
           {
             case WIFI_AUTH_OPEN:            Tekstprint("open");      break;
             case WIFI_AUTH_WEP:             Tekstprint("WEP");       break;
             case WIFI_AUTH_WPA_PSK:         Tekstprint("WPA");       break;
             case WIFI_AUTH_WPA2_PSK:        Tekstprint("WPA2");      break;
             case WIFI_AUTH_WPA_WPA2_PSK:    Tekstprint("WPA+WPA2");  break;
             case WIFI_AUTH_WPA2_ENTERPRISE: Tekstprint("WPA2-EAP");  break;
             case WIFI_AUTH_WPA3_PSK:        Tekstprint("WPA3");      break;
             case WIFI_AUTH_WPA2_WPA3_PSK:   Tekstprint("WPA2+WPA3"); break;
             case WIFI_AUTH_WAPI_PSK:        Tekstprint("WAPI");      break;
             default:                        Tekstprint("unknown");
            }
        Tekstprintln("");
        delay(10);
        }
   }
Tekstprintln("");
//WiFi.scanDelete();                                                                            // Delete the scan result to free memory for code below.
}
//--------------------------------------------                                                //
// WIFI Check for WIFI router SSID and password 
// If not valid then start webpage to enter the credentials
//--------------------------------------------
void ConnectWIFI(void)
{
if( (strlen(Mem.Password)<5 || strlen(Mem.SSID)<3))   // If WIFI required and no SSID or password
   {
     Tekstprintln("Starting AP mode to enter SSID and password of the WIFI router");
     StartAPMode();
   }  
 else 
  { 
    Tekstprintln("Starting WIFI/NTP");
    StartWIFI_NTP();
  }
 }
//--------------------------------------------                                                //
// WIFI Check if WIFI is still connected and if not restore it
//-------------------------------------------- 
void CheckRestoreWIFIconnectivity(void)
{
 if(!Mem.WIFIOn || InApMode) return;                                                          // If in WIFI APmode or there is nothing to check
 if(!WIFIwasConnected)
        { if(CheckforWIFINetwork(false) ) StartWIFI_NTP(); }                                  // If there was no WIFI at start up start a WIFI connection       
 if(Mem.WIFIOn && WIFIwasConnected)                                                           // If WIFI switch is On and there was a connection.
   {
    if(WiFi.localIP()[0] == 0) 
       {
        if(Mem.WIFIcredentials == SET_AND_OK)  WiFi.reconnect();                              // If connection lost and WIFI is used reconnect
        if(WiFi.localIP()[0] != 0)                                                            // WIFI connection is established
          {
          snprintf(sptext, sizeof(sptext), "Reconnected to IP address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );
          Tekstprintln(sptext);
          }
       }
    }
    
 static uint16_t RebootTime = 30; //hours
 if(WiFi.localIP()[0] == 0 && Mem.WIFIcredentials == SET_AND_OK )                                                                                               // Extra failsafe.If for some reason there is no IP address after 30 sec. Then restart
   { 
     NoConnectionCounter++; 
     snprintf(sptext, sizeof(sptext),"No connection for %d hour, will restart in %d hours",NoConnectionCounter, RebootTime  - NoConnectionCounter); 
     Tekstprintln(sptext);
    }
 else NoConnectionCounter = 0;

 if  (NoConnectionCounter > RebootTime ) 
     { 
      Tekstprintln(" ---> Will reboot");
      shouldReboot = true;                                                                    // ESP will restart
      Mem.WIFInoConnection++;                                                                 // Will store the no of reboots
      StoreStructInFlashMemory();
     }   

if(Loopcounter<10)                                                                            // Then something is really wrong
  {
  if(CheckforWIFINetwork(true)) 
    { 
     Tekstprintln("Loopcounter<10 and network available. --> Will reboot"); 
     shouldReboot = true;                                                                     // ESP will restart
     Mem.LoopRebooted++;                                                                      // will store the no of reboots. 
     StoreStructInFlashMemory();
    }
  }
}

//--------------------------------------------                                                //
// WIFI Start WIFI connection and NTP service
//--------------------------------------------
bool StartWIFI_NTP(void)
{
 WiFi.disconnect(true,true);                                                                  // Remove all previous settings and entered SSID and password
 delay(100);
 WiFi.setHostname(Mem.BLEbroadcastName);                                                      // Set the host name in the WIFI router instead of a cryptic esp32 name
 WiFi.mode(WIFI_STA);  
 WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, INADDR_NONE);
 WIFIwasConnected = false;
 WiFi.begin(Mem.SSID, Mem.Password);
 wifiEventHandler = WiFi.onEvent(WiFiEvent);                                                  // Using WiFi.onEvent interrupts and crashes IL9341 screen display while writing the screen
 MDNS.begin(Mem.BLEbroadcastName);                                                            // After reset http://wordclock.local 

